src/test/resources/invoice.xml

<?xml version="1.0" encoding="UTF-8"?>
<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2"
         xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2"
         xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
         xsi:schemaLocation="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2 UBL-Invoice-2.1.xsd">

    <!-- Invoice Header -->
    <cbc:UBLVersionID>2.1</cbc:UBLVersionID>
    <cbc:CustomizationID>urn:pe:gob:sunat:cpe:see:gem:catalogos:catalogo51</cbc:CustomizationID>
    <cbc:ID>INV001</cbc:ID>
    <cbc:IssueDate>2023-11-29</cbc:IssueDate>
    <cbc:DueDate>2023-12-15</cbc:DueDate>
    <cbc:InvoiceTypeCode>01</cbc:InvoiceTypeCode>
    <cbc:DocumentCurrencyCode>USD</cbc:DocumentCurrencyCode>

    <!-- Seller Information -->
    <cac:AccountingSupplierParty>
        <cac:Party>
            <cac:PartyIdentification>
                <cbc:ID schemeID="urn:pe:gob:sunat:cpe:see:gem:catalogos:catalogo06">12345678901</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>Seller Company</cbc:Name>
            </cac:PartyName>
            <cac:PartyAddress>
                <cbc:StreetName>Main Street</cbc:StreetName>
                <cbc:CityName>City</cbc:CityName>
                <cbc:CountrySubentity>State</cbc:CountrySubentity>
                <cbc:District>District</cbc:District>
                <cac:Country>
                    <cbc:IdentificationCode>PE</cbc:IdentificationCode>
                </cac:Country>
            </cac:PartyAddress>
        </cac:Party>
    </cac:AccountingSupplierParty>

    <!-- Buyer Information -->
    <cac:AccountingCustomerParty>
        <cac:Party>
            <cac:PartyIdentification>
                <cbc:ID schemeID="urn:pe:gob:sunat:cpe:see:gem:catalogos:catalogo06">98765432109</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>Buyer Company</cbc:Name>
            </cac:PartyName>
            <cac:PartyAddress>
                <cbc:StreetName>Second Street</cbc:StreetName>
                <cbc:CityName>City</cbc:CityName>
                <cbc:CountrySubentity>State</cbc:CountrySubentity>
                <cbc:District>District</cbc:District>
                <cac:Country>
                    <cbc:IdentificationCode>PE</cbc:IdentificationCode>
                </cac:Country>
            </cac:PartyAddress>
        </cac:Party>
    </cac:AccountingCustomerParty>

    <!-- Invoice Lines -->
    <cac:InvoiceLine>
        <cbc:ID>1</cbc:ID>
        <cbc:InvoicedQuantity unitCode="EA">10</cbc:InvoicedQuantity>
        <cbc:LineExtensionAmount currencyID="USD">100.00</cbc:LineExtensionAmount>
        <cac:Item>
            <cbc:Name>Product A</cbc:Name>
            <cac:SellersItemIdentification>
                <cbc:ID>PROD001</cbc:ID>
            </cac:SellersItemIdentification>
        </cac:Item>
        <cac:Price>
            <cbc:PriceAmount currencyID="USD">10.00</cbc:PriceAmount>
        </cac:Price>
    </cac:InvoiceLine>

    <!-- Additional Invoice Details -->
    <cac:TaxTotal>
        <cbc:TaxAmount currencyID="USD">18.00</cbc:TaxAmount>
        <cac:TaxSubtotal>
            <cbc:TaxAmount currencyID="USD">18.00</cbc:TaxAmount>
            <cac:TaxCategory>
                <cac:TaxScheme>
                    <cbc:ID>1000</cbc:ID>
                    <cbc:Name>IGV</cbc:Name>
                    <cbc:TaxTypeCode>VAT</cbc:TaxTypeCode>
                </cac:TaxScheme>
            </cac:TaxCategory>
        </cac:TaxSubtotal>
    </cac:TaxTotal>

    <!-- Total Amount -->
    <cac:LegalMonetaryTotal>
        <cbc:LineExtensionAmount currencyID="USD">100.00</cbc:LineExtensionAmount>
        <cbc:TaxExclusiveAmount currencyID="USD">100.00</cbc:TaxExclusiveAmount>
        <cbc:TaxInclusiveAmount currencyID="USD">118.00</cbc:TaxInclusiveAmount>
    </cac:LegalMonetaryTotal>

</Invoice>
